In [2]:
import pandas as pd

data = {
    'name':['철수', '영희', '민수'],
    'age': [28,22,28],
    'gender':['men','female','male']
}

df = pd.DataFrame(data)

df

  name  age  gender
0   철수   28     men
1   영희   22  female
2   민수   28    male

In [18]:
df.to_csv("df.csv",index=False)

In [20]:
df=pd.read_csv("df.csv")

In [17]:
df['age']

0    28
1    22
2    28
Name: age, dtype: int64

In [4]:
df['gender']

0       men
1    female
2      male
Name: gender, dtype: object

In [5]:
df['name']

0    철수
1    영희
2    민수
Name: name, dtype: object

In [7]:
data = {
    'name':['철수', '영희', '민수'],
    'age': [28,22,28],
    'gender':['men','female','male']
}

columns = ['name','age','gender']
df = pd.DataFrame(data, columns=columns)

df

  name  age  gender
0   철수   28     men
1   영희   22  female
2   민수   28    male

In [9]:
data2 = [
    ['철수', 28, 'male'],
    ['영희',22, 'female'],
    ['민수','28','male']
]

In [12]:
import pandas as pd
data3 =pd.Series([100, 200, 300, 400, 500],index=['a','b','c','d','e'])

In [13]:
data3.name = 'number'

In [14]:
df

  name  age  gender
0   철수   28     men
1   영희   22  female
2   민수   28    male